; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v1 - type_1 ?v2 - type_3)
 	      (pred_2 ?v8 - object ?v2 - type_3)
	      (pred_3 ?v1 - type_1 ?v7 - type_2)
	      (pred_4 ?v1 - type_1 ?v8 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v1 - type_1 ?v4 ?v6 - type_3)
       :precondition (and  (pred_1 ?v1 ?v4))
       :effect (and  (pred_1 ?v1 ?v6)
		     (not (pred_1 ?v1 ?v4))))

   (:action op_3
       :parameters (?v1 - type_1 ?v5 - object ?v3 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v3) (pred_1 ?v1 ?v3) (pred_3 ?v1 ?v7))
       :effect (and (pred_4 ?v1 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v3)) 
		    (not (pred_3 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_1 ?v5 - object ?v3 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v5 ?v7) (pred_1 ?v1 ?v3))
       :effect (and (pred_2 ?v5 ?v3)
		    (pred_3 ?v1 ?v7)
		    (not (pred_4 ?v1 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_04 - type_1
obj_10 obj_03 obj_08 obj_02 - type_2
obj_12 obj_01 obj_05 obj_14 - type_3
obj_06 obj_13 obj_07 obj_09 - object)
(:init
(pred_1 obj_11 obj_05)
(pred_3 obj_11 obj_10)
(pred_3 obj_11 obj_03)
(pred_1 obj_04 obj_12)
(pred_3 obj_04 obj_08)
(pred_3 obj_04 obj_02)
(pred_2 obj_06 obj_01)
(pred_2 obj_13 obj_12)
(pred_2 obj_07 obj_01)
(pred_2 obj_09 obj_14)
)
(:goal
(and
(pred_2 obj_06 obj_05)
(pred_2 obj_13 obj_05)
(pred_2 obj_07 obj_14)
(pred_2 obj_09 obj_01)
)
)

(:constraints
  (always (not (pred_1 obj_11 obj_14)))
)
)

; plan
1. (op_3 obj_04 obj_13 obj_12 obj_02)
   deleted: (pred_2 obj_13 obj_12) (pred_3 obj_04 obj_02)
   added: (pred_4 obj_04 obj_13 obj_02)
   goals met: 0 of 4
2. (op_1 obj_11 obj_05 obj_01)
   deleted: (pred_1 obj_11 obj_05)
   added: (pred_1 obj_11 obj_01)
   goals met: 0 of 4
3. (op_1 obj_04 obj_12 obj_05)
   deleted: (pred_1 obj_04 obj_12)
   added: (pred_1 obj_04 obj_05)
   goals met: 0 of 4
4. (op_3 obj_11 obj_07 obj_01 obj_03)
   deleted: (pred_2 obj_07 obj_01) (pred_3 obj_11 obj_03)
   added: (pred_4 obj_11 obj_07 obj_03)
   goals met: 0 of 4
5. (op_2 obj_04 obj_13 obj_05 obj_02)
   deleted: (pred_4 obj_04 obj_13 obj_02)
   added: (pred_2 obj_13 obj_05) (pred_3 obj_04 obj_02)
   goals met: 1 of 4
6. (op_2 obj_11 obj_07 obj_01 obj_03)
   deleted: (pred_4 obj_11 obj_07 obj_03)
   added: (pred_2 obj_07 obj_01) (pred_3 obj_11 obj_03)
   goals met: 1 of 4
7. (op_1 obj_04 obj_05 obj_01)
   deleted: (pred_1 obj_04 obj_05)
   added: (pred_1 obj_04 obj_01)
   goals met: 1 of 4
8. (op_3 obj_04 obj_06 obj_01 obj_02)
   deleted: (pred_2 obj_06 obj_01) (pred_3 obj_04 obj_02)
   added: (pred_4 obj_04 obj_06 obj_02)
   goals met: 1 of 4
9. (op_1 obj_04 obj_01 obj_05)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_05)
   goals met: 1 of 4
10. (op_2 obj_04 obj_06 obj_05 obj_02)
   deleted: (pred_4 obj_04 obj_06 obj_02)
   added: (pred_2 obj_06 obj_05) (pred_3 obj_04 obj_02)
   goals met: 2 of 4
11. (op_1 obj_04 obj_05 obj_14)
   deleted: (pred_1 obj_04 obj_05)
   added: (pred_1 obj_04 obj_14)
   goals met: 2 of 4
12. (op_3 obj_04 obj_09 obj_14 obj_02)
   deleted: (pred_2 obj_09 obj_14) (pred_3 obj_04 obj_02)
   added: (pred_4 obj_04 obj_09 obj_02)
   goals met: 2 of 4
13. (op_1 obj_04 obj_14 obj_01)
   deleted: (pred_1 obj_04 obj_14)
   added: (pred_1 obj_04 obj_01)
   goals met: 2 of 4
14. (op_2 obj_04 obj_09 obj_01 obj_02)
   deleted: (pred_4 obj_04 obj_09 obj_02)
   added: (pred_2 obj_09 obj_01) (pred_3 obj_04 obj_02)
   goals met: 3 of 4
15. (op_3 obj_04 obj_07 obj_01 obj_02)
   deleted: (pred_2 obj_07 obj_01) (pred_3 obj_04 obj_02)
   added: (pred_4 obj_04 obj_07 obj_02)
   goals met: 3 of 4
16. (op_1 obj_04 obj_01 obj_14)
   deleted: (pred_1 obj_04 obj_01)
   added: (pred_1 obj_04 obj_14)
   goals met: 3 of 4
17. (op_2 obj_04 obj_07 obj_14 obj_02)
   deleted: (pred_4 obj_04 obj_07 obj_02)
   added: (pred_2 obj_07 obj_14) (pred_3 obj_04 obj_02)
   goals met: 4 of 4
